# SetCustomObjectProfileGroup

## Description
Sets the profile group for a path custom object.

```pascal
FUNCTION SetCustomObjectProfileGroup(
				objectHand       : HANDLE;
				profileGroupHand : HANDLE): BOOLEAN;
```

```python
def vs.SetCustomObjectProfileGroup(objectHand, profileGroupHand):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHand|HANDLE|Handle to object.|
|profileGroupHand|HANDLE|Handle to profile group.|

## See Also
VS Functions:
GetCustomObjectProfileGroup

## Version
Availability: from VectorWorks8.5

## Category
* Objects - Custom